Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.production.module.api-gateway.aws_api_gateway_integration.iac-api-gateway-integration has changed
~ resource "aws_api_gateway_integration" "iac-api-gateway-integration" {
      + cache_key_parameters    = []
        id                      = "agi-kb4bj3xon8-rekm5u-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }

  # module.production.module.api-gateway.aws_api_gateway_method.iac-api-gateway-method-google-enter has changed
~ resource "aws_api_gateway_method" "iac-api-gateway-method-google-enter" {
      + authorization_scopes = []
        id                   = "agm-kb4bj3xon8-rekm5u-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }

  # module.production.module.api-gateway.aws_api_gateway_rest_api.iac-api-gateway has changed
~ resource "aws_api_gateway_rest_api" "iac-api-gateway" {
        id                           = "kb4bj3xon8"
        name                         = "iac-api-gateway"
      + tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.production.module.api-gateway.aws_api_gateway_integration.iac-api-gateway-integration will be destroyed
  # (because aws_api_gateway_integration.iac-api-gateway-integration is not in configuration)
- resource "aws_api_gateway_integration" "iac-api-gateway-integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "rekm5u" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb4bj3xon8-rekm5u-GET" -> null
      - integration_http_method = "GET" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "rekm5u" -> null
      - rest_api_id             = "kb4bj3xon8" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "HTTP_PROXY" -> null
      - uri                     = "http://google.com" -> null
    }

  # module.production.module.api-gateway.aws_api_gateway_integration.iac-api-gateway-integration-google-enter will be created
+ resource "aws_api_gateway_integration" "iac-api-gateway-integration-google-enter" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "rekm5u"
      + rest_api_id             = "kb4bj3xon8"
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://google.com"
    }

  # module.production.module.api-gateway.aws_api_gateway_integration.iac-api-gateway-integration-google-exit will be created
+ resource "aws_api_gateway_integration" "iac-api-gateway-integration-google-exit" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb4bj3xon8"
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://google.com"
    }

  # module.production.module.api-gateway.aws_api_gateway_method.iac-api-gateway-method-google-exit will be created
+ resource "aws_api_gateway_method" "iac-api-gateway-method-google-exit" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb4bj3xon8"
    }

  # module.production.module.api-gateway.aws_api_gateway_resource.iac-api-gateway-resource-google-exit will be created
+ resource "aws_api_gateway_resource" "iac-api-gateway-resource-google-exit" {
      + id          = (known after apply)
      + parent_id   = "4jr77i"
      + path        = (known after apply)
      + path_part   = "exit"
      + rest_api_id = "kb4bj3xon8"
    }

Plan: 4 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
